In [39]:
import sys
from pathlib import Path
project_root = Path.cwd().parent          # текущий каталог = notebooks/
src_path     = project_root / "src"
if str(src_path) not in sys.path:
    sys.path.insert(0, str(src_path))

In [41]:
import pandas as pd
from sklearn.model_selection import train_test_split
from pipeline import inference_titanic_pipeline

In [5]:
df_titanic = pd.read_csv(r'C:\Users\geleo\pythonProject\eda_project\data\Titanic-Dataset.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df_titanic.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [7]:
df_titanic.shape

(891, 12)

In [10]:
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
df_titanic.isna().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [6]:
df_hous = pd.read_csv(r'C:\Users\geleo\pythonProject\eda_project\data\Housing.csv')
df_hous.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [12]:
df_hous.shape

(545, 13)

In [13]:
df_hous.dtypes

price                int64
area                 int64
bedrooms             int64
bathrooms            int64
stories              int64
mainroad            object
guestroom           object
basement            object
hotwaterheating     object
airconditioning     object
parking              int64
prefarea            object
furnishingstatus    object
dtype: object

In [14]:
df_hous.isna().mean()

price               0.0
area                0.0
bedrooms            0.0
bathrooms           0.0
stories             0.0
mainroad            0.0
guestroom           0.0
basement            0.0
hotwaterheating     0.0
airconditioning     0.0
parking             0.0
prefarea            0.0
furnishingstatus    0.0
dtype: float64

In [22]:
y = df_titanic["Survived"]
X = df_titanic.drop(columns=["Survived",'PassengerId', 'Name', 'Ticket'])

In [26]:
X_train, X_test, y_train, y_test = train_test_split(
    X, y,
    test_size=0.20,
    random_state=42,
    stratify=y            
)

In [29]:
(X_train.isna().mean() * 100).round(1)

Pclass       0.0
Sex          0.0
Age         19.2
SibSp        0.0
Parch        0.0
Fare         0.0
Cabin       77.5
Embarked     0.3
dtype: float64

In [30]:
(X_test.isna().mean() * 100).round(1)

Pclass       0.0
Sex          0.0
Age         22.3
SibSp        0.0
Parch        0.0
Fare         0.0
Cabin       75.4
Embarked     0.0
dtype: float64

In [31]:
y_train.value_counts()

Survived
0    439
1    273
Name: count, dtype: int64

In [32]:
y_test.value_counts()

Survived
0    110
1     69
Name: count, dtype: int64

In [42]:
inference_titanic_pipeline(X_train, X_test, y_train, y_test)

              precision    recall  f1-score   support

           0      0.829     0.882     0.855       110
           1      0.790     0.710     0.748        69

    accuracy                          0.816       179
   macro avg      0.810     0.796     0.801       179
weighted avg      0.814     0.816     0.814       179

ROC‑AUC: 0.8429512516469039